In [1]:
import numpy as np
import pandas as pd

In [2]:
# Numpy中处理缺失数据
a=np.array([1,None,5,7,9])
b=np.array([1,3,5,7,9])
a.dtype

dtype('O')

In [6]:
b.dtype

dtype('int32')

In [7]:
b.sum()

25

In [8]:
a.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [9]:
c=np.array([1,np.nan,5,7,9])
c.dtype

dtype('float64')

In [11]:
c.sum()

nan

In [12]:
np.nansum(c)

22.0

In [16]:
# Pandas处理缺失数据
# Pandas自己就会处理
s=pd.Series([1,np.nan,3,None,7,9])
s

0    1.0
1    NaN
2    3.0
3    NaN
4    7.0
5    9.0
dtype: float64

In [17]:
# 计算时pandas自动摒除了NaN数据
s.sum()

20.0

In [18]:
s.isnull()

0    False
1     True
2    False
3     True
4    False
5    False
dtype: bool

In [19]:
s.notnull()

0     True
1    False
2     True
3    False
4     True
5     True
dtype: bool

In [20]:
s[s.notnull()]

0    1.0
2    3.0
4    7.0
5    9.0
dtype: float64

In [21]:
s.dropna()

0    1.0
2    3.0
4    7.0
5    9.0
dtype: float64

In [22]:
# Pandas中的DataFrame
df=pd.DataFrame([[1,2,np.nan,4],[5,None,7,8],[9,10,11,12]])
df

   0     1     2   3
0  1   2.0   NaN   4
1  5   NaN   7.0   8
2  9  10.0  11.0  12

In [23]:
df.dropna()

   0     1     2   3
2  9  10.0  11.0  12

In [31]:
df.dropna(axis=1)

   0   3
0  1   4
1  5   8
2  9  12

In [33]:
df.dropna(axis='columns')

   0   3
0  1   4
1  5   8
2  9  12